# IFCRange Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCRange Constructor
IFCRange Class See Also
---
Instantiates a default IFCRange object.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IFCRange()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
IFCRange()
```

# Remarks
The starting and ending value are both set to zero.
# See Also
IFCRange Class
IFCRange Overload
Autodesk.Revit.DB.IFC Namespace